# WalkthroughFramesCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WalkthroughFramesCount Property
ParameterTypeId Class See Also
---
"Walkthrough Frames"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WalkthroughFramesCount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WalkthroughFramesCount As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WalkthroughFramesCount {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace